Tekla Open API Reference for Tekla Structures 2025
TemplateInfo.Default Field
 The default template information.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static TemplateInfo Default
Public Shared Default As TemplateInfo
Field Value
Type: TemplateInfo
See Also
Reference
TemplateInfo Class
Tekla.Structures.Drawing Namespace